/*
 *****************************************************************************************
 *
 * 功能：   本程序主要是将相邻相同的元素用（）进行标记
 *
 * 文件名： P6_8.cpp
 *
 * 作者：   Chen rui
 *
 * 单位：   河南大学计算机与信息工程学院
 *
 * E-mail:  1257946523@qq.com
 *
 * 时间：   2021年5月4日
 *
 * 版本：   1.0
 *
 ******************************************************************************************
 */
#include <iostream>
#include<string>
#include<ctime>
#include<cstdlib>

using namespace std;

int main()
{
    int b, c;
    int a[9][10] = { 10,10,10,10,10,10,10,10,10,10,10,10,10,10,10,10,10,10,10,10,10,10,10,10,10,10,10,10,10,10,10,10,20,20,20,20,20,20,10,10,10,10,20,20,20,20,20,20,10,10,10,10,20,20,20,20,20,20,10,10,20,20,30,30,40,40,30,30,20,20,20,30,30,40,50,50,40,30,30,20,30,40,50,50,50,50,50,50,40,30 };
    for (int i = 0; i < 9; i++)
    {
        for (int j = 0; j < 10; j++)
        {
            cout << a[i][j] << "\t";
        }
        cout << endl;
    }
    cout << "您可以选择座位或者价格：(输入1~9为第几排，输入10及其它十位整数视为价格):" << endl;
    cin >> b;

    if (b < 10)
    {
        cout << "请输入列数";
        cin >> c;

        cout << "购买成功！您选择的座位是第" << b << "排，第" << c << "列，价格为" << a[b - 1][c - 1];
    }
    else if (b = 10)
    {
        srand(time(0));
        int r = rand() % 6 + 1;
        int l;
        if (r < 3)
            l = rand() % 10 + 1;
        else if (r > 3)
        {
            l = rand() % 4 + 1;
            if (l == 3)
                l = 9;
            if (l == 4)
                l = 10;
        }
        cout << "购买成功！您选择的座位是第" << r << "排，第" << l << "列，价格为" << b;
    }
    else if (b = 20)
    {
        srand(time(0));
        int r = rand() % 5 + 4;
        int l;
        if (r > 3 && r < 7)
            l = rand() % 6 + 3;
        else if (r == 7)
        {
            l = rand() % 4 + 1;
            if (l == 3)
                l = 9;
            if (l == 4)
                l = 10;
        }
        else if (r == 8)
        {
            l = rand() % 2 + 1;
            if (l == 2)
                l = 10;
        }
        cout << "购买成功！您选择的座位是第" << r << "排，第" << l << "列，价格为" << b;
    }
    else if (b = 30)
    {
        srand(time(0));
        int r = rand() % 3 + 7;
        int l;
        if (r == 7)
        {
            l = rand() % 4 + 3;
            if (l = 5)
                l = 7;
            if (l = 6)
                l = 8;
        }
        else if (r == 8)
        {
            l = rand() % 4 + 2;
            if (l = 4)
                l = 8;
            if (l = 5)
                l = 9;
        }
        else if (r == 9)
        {
            l = rand() % 2 + 1;
            if (l = 2)
                l = 10;
        }
        cout << "购买成功！您选择的座位是第" << r << "排，第" << l << "列，价格为" << b;
    }
    else if (b = 40)
    {
        srand(time(0));
        int r = rand() % 3 + 7;
        int l;
        if (r == 7)
        {
            l = rand() % 2 + 5;
        }
        else if (r == 8)
        {
            l = rand() % 2 + 4;
            if (l = 5)
                l = 7;
        }
        else if (r == 9)
        {
            l = rand() % 2 + 2;
            if (l = 3)
                l = 9;
        }
        cout << "购买成功！您选择的座位是第" << r << "排，第" << l << "列，价格为" << b;
    }
    else if (b = 50)
    {
        srand(time(0));
        int r = rand() % 3 + 7;
        int l;
        if (r == 8)
        {
            l = rand() % 2 + 5;
        }
        else if (r == 9)
        {
            l = rand() % 6 + 3;
        }
        cout << "购买成功！您选择的座位是第" << r << "排，第" << l << "列，价格为" << b;
    }
    return 0;
}
