/*
 *****************************************************************************************
 *
 * 功能：   本程序主要是打印输出
 *
 * 文件名： E7_1.cpp
 *
 * 作者：   Rui Chen
 *
 * 单位：   河南大学计算机与信息工程学院
 *
 * E-mail: 2280781256@qq.com
 *
 * 时间：   2021年5月6日
 *
 * 版本：   1.0
 *
 ******************************************************************************************
 */
/*#include<iostream>
using namespace std;
void sort2(int* a, int* b)
{
	if (*a > *b)
	{
		int temp = *a;
		*a = *b;
		*b = temp;
	}
}
int main()
{
	int a, b;
	cout << "请输入两个数：";
	cin >> a >> b;
	sort2(&a, &b);
	system("pause");
	return 0;
}*/